// FlatOut 2 Decompilation

// So here's what I've learned using Cheat Engine:
//
// 0x37CB2A4 and 0x37CB325 are 4-byte integers, counting up during the game, like a timer or something.
// I've found that these values are set rather than incremented, because I can't override the value.
//
// Things that I have tried overriding and nothing happened:
// 
// 0x6D6AE0 through 0x6D6BE8 is related to the currently selected car when choosing one
//
// When choosing a car, 0x6D69D8 through 0x6D6A0B flip between two different states based on the car.
//
// The name of the currently playing song is printed at 0x6D6D50.
// 



// Bugbear used Visual Studio 2003, which means we know the IDE, compiler, all that. But finding a copy these days is difficult.

// Originally I made my own names for globals, but I'm now including the address to make investigating easier.

// I don't think these are included but hey
#include <stdio.h>
#include <stdarg.h>

#include <memoryapi.h>
#include <WinUser.h>

// D3D9.DLL
#include <d3d9.h>

// D3DX9_30.DLL
// Requires you to run this command in Visual Studio's NuGet console:
// NuGet\Install-Package Microsoft.DXSDK.D3DX -Version 9.29.952.8

#include "D3DX9Effect.h"
#include "D3dx9tex.h"

#include <dinput.h>


// GDI32.DLL
#include <wingdi.h>

#include <strsafe.h>

// IPHLPAPI.DLL
#include <iphlpapi.h>

#include <winreg.h>

// WINMM.DLL
#include <timeapi.h>

#include <combaseapi.h>
#include <shellapi.h>
#include <fileapi.h>
#include <libloaderapi.h>
#include <process.h>
#include <synchapi.h>
#include <winbase.h>
#include <winsock.h>
#include <winsock2.h>
#include <sys/stat.h>

/////////////////////////////////////////////////
// Variables
// They have been sorted by address location, grouped by relevance when possible.

struct Settings Settings;

DLGPROC g_dlgproc;

LPCSTR lpOperation_0066ab90;

const char* u_NO_TEXT_0066b38c = "u\"NO_TEXT\"";

// This build is dated September 20th, 2004, which is a couple months before FlatOut 1 released.
// Leads me to believe it means ROMU v0.28
const char* verString_00698b4c = "Version_0.28_build_2004.09.20";

// These are treated like an array, AutoClass31s have an index into these DATs
unsigned int DAT_0069ba70;
unsigned int DAT_0069ba74;
unsigned int DAT_0069ba78;
unsigned int DAT_0069ba7c;
unsigned int DAT_0069ba80;
unsigned int DAT_0069ba84;
unsigned int DAT_0069ba88;
unsigned int DAT_0069ba8c;

unsigned int UINT_0069c2d0;

const char** PTR_u_NO_TEXT_0069df4 = &u_NO_TEXT_0066b38c;

DWORD TimePassed_006a32e8;

HGDIOBJ HGDIOBJ_006d67b8;
LRESULT DAT_006d68dc;
LRESULT DAT_006d68e0;
LRESULT DAT_006d68ec;
LRESULT UINT_006d6900;
unsigned int UINT_006d6908;

unsigned int UINT_006d690c;
unsigned int UINT_006d68d0;
unsigned int UINT_006d68d8;
unsigned int UINT_006d68e8;
unsigned int UINT_006d68f0;

void* PTR_LAB_007a9e4[5];

unsigned short FPUConW_008d781c;

unsigned int UINT_008d780c;
unsigned int UINT_008d7bb0;


unsigned int UINT_008da270;
HINSTANCE HINST_008da2dc;



unsigned int UINT_008da540;
HICON HICON_008da544;
unsigned int UINT_008da548;

void* MEM_008da568;

unsigned int UINT_008da728;

// 1 = delete bfs file on opening, 0 = normal
unsigned int UINT_008da730;

IDirect3D9* D3D9_008da784;
HWND HWND_008da79c;

unsigned int UINT_008d7c30;

HWND HWND_008da56c;

// It's an int, but used as a bool.
int setupFlag_008da684 = 0;

unsigned int unkn_008da6a0;

// The handle of the .exe file
HINSTANCE HINST_008da564;

void (*FUNC_008da6f4)();

unsigned int UINT_008da6fc;

unsigned int UINT_008da700;
AutoClass24* AC24_008da72c;
unsigned int UINT_008da730;

LRESULT UINT_008db344[30];

unsigned int UINT_008e5770;

unsigned int UINT_008e5d70;

int* int_008e8420;

unsigned int UINT_008e855c;

void* MemoryPointer;
size_t memAllocationSize;

int _Size;



const char* Funcs_00652918[] =
{
    "__index",
    "__newindex",
    (const char*)0x5F,
    "__mode",
    (const char*)0x5F,
    "__add",
    "__sub",
    "__mul",
    "__div",
    "__mod",
    "__pow",
    "__unm",
    "__len",
    (const char*)0x5F,
    (const char*)0x5F,
    "__concat",
    "__call"
};

/////////////////////////////////////////////////
// Structs

// astruct_1
struct ArrayMaybe {
    INT count;
    // 4 undefined bytes at offset 0x4
    INT lenOfItem;
    // 8 undefined bytes at offset 0xC
    INT memLoc;
};

// Returns the memory address of an item in an array, or 0.
int GetItem(ArrayMaybe* rray, int index)
{
    if ((index > -1) && (index < rray->count))
    {
        return rray->lenOfItem * index + rray->memLoc;
    }
    return 0;
}

struct astruct_42 {
    void (*func_0x0)();
    unsigned int field1_0x4;
    unsigned int field2_0x8;
    unsigned int field3_0x10;
    // Maybe this is all one buffer, I don't know
    DWORD dw1_0xc;
    // 4 undefined bytes at offset 0x10
    DWORD dwbuffer1_0x14[10];
    // 4 undefined bytes at offset 0x3c
    DWORD dwbuffer2_0x40[35];
    // 4 undefined bytes at offset 0xcc
    unsigned int field4_0xd0;
    // 12 undefined bytes at offset 0xd4
    unsigned int field5_0xe0;
    unsigned int field6_0xe4;
};

struct astruct_97 {
    // 8 undefined bytes at offset 0x0
    unsigned int** field_0x8[2];
    int* field_0x10;
};


struct astruct_110 {
    // 4 undefined bytes at 0x0
    int field0_0x4;
    unsigned int field1_0x8;
    int field2_0xc;
    // 136 undefined bytes at 0x10
    undefined4 field3_0x98;
    undefined4 field4_0x9c;
    undefined4 field5_0xa0;
    unsigned int field6_0xa4;
};

struct astruct_114
{
    // 8 Undefined bytes at 0x0
    int* field8_0x8;
    int field9_0xc;
    int field10_0x10;
    int field11_0x14;
    // 44 Undefined bytes at 0x18
    int* field56_0x44;
    // 4 undefined bytes at 0x48
    int field61_0x4c;
    int field62_0x50;
};

struct astruct_138
{
    // 100 undefined bytes at offset 0x0
    unsigned int int_0x64;
    HANDLE handle_0x68;
    // 8 undefined bytes at offset 0x6C
    LONG long_0x74;
    void * unkn_0x78;
    // 4 undefined bytes at offset 0x7C
    DWORD dw_0x80;
};

struct astruct_140 {
    // 64 undefined bytes at offset 0x0
    unsigned int field0_0x40;
    unsigned int field1_0x44;
    // 16 undefined bytes at offset 0x48
    HINSTANCE hinst_0x58;
};

struct astruct_147 {
    int int1_0x0;
    int int2_0x4;
};

struct astruct_148 {
    // 4 undefined bytes at offset 0x0
    LPCRITICAL_SECTION critical_0x4;
    // 25 undefined bytes at offset 0x8
    char char_0x21;
};

// placeholder
struct undefined4 {
    float nothing;
};

// Settings Structures
// Got this info from the cfg files

struct Version {
    unsigned int Settings = 15; // 0 - 1,000,000
};

struct Game {
    bool ImperialUnits = false;
    bool OverlayGauges = true;
    bool IngameMap = true;
    bool Ragdoll = true;
    bool ShowBonus = true;
    bool ShowTutorials = true;
    char DefaultPlayerName[7] = "PLAYER";
    int Camera = 0; // 0 - 9
    int Hud = 0;    // 0 - 4
};

struct Control {
    char ControllerGuid[33] = "00000000000000000000000000000000";
    int Controller = 0;                     // 0 - 2
    int ForceMagnitude = 100;               // 0 - 100
    int ControllerSensitivity = 90;         // 0 - 100
    int ControllerDeadzone = 0;             // 0 - 100
    int ControllerSaturation = 90;          // 0 - 100
    int ControllerLayout = 0;               // 0 - 10
    bool ForceFeedback = true;
    float DigitalCenteringSpeed = 0.999f;   // 0.0 - 100.0
    float DigitalSteeringMaxSpeed = 1.85f;  // 0.0 - 100.0
    float DigitalSteeringMinSpeed = 1.25f;  // 0.0 - 100.0
};

struct Visual {
    bool AlphaBlend = true;
    bool SunFlare = true;
    int TextureQuality = 4;       // 0 - 4
    int TrackDetail = 2;          // 0 - 2
    int PS2MotionBlurIngame = 32; // 0 - 255
    int Visibility = 100;         // 0 - 100
};

struct Audio {
    int InterfaceMusicVolume = 50;  // 0 - 100
    int InterfaceSfxVolume = 80;    // 0 - 100
    int IngameMusicVolume = 50;     // 0 - 100
    int IngameSfxVolume = 80;      // 0 - 100
    int ChannelMode = 0;            // 0 - 2
    bool DopplerEffects = false;
};

struct Network {
    unsigned int Port = 23756;                     // 0 - 65536
    unsigned int BroadcastPort = 23757;            // 0 - 65536
    int VoiceOutputVolume = 80;           // 0 - 100
    int VoiceJitterMaxDelay = 10;         // 0 - 100
    int VoiceJitterMaxVariation = 10;     // 0 - 100
    int VoiceJitterInitialVariation = 2;  // 0 - 100
    float VoiceTalkingLevel = 15.f;       // 0.0 - 90.0
    bool MutePlayerVoice = true;
    bool MuteVoiceIngame = false;
};

struct Settings {
    struct Version Version;
    struct Game Game;
    struct Control Control;
    struct Visual Visual;
    struct Audio Audio;
    struct Network Network;
};

/////////////////////////////////////////////////
// Classes

// Credit to mrwonko on GitHub for their file object reverse engineering
// AutoClass 25
class FileObject
{
public:
    void* vtable;

    char buffer[0x4000]; // 0x4

    int alwaysNeg1;           // 0x4004 - is -1 on newly opened track_spvs.gen,
    // Ghidra says it's always -1

    char* filePos;         // 0x4008 - "virtual" file pos - reads in 16kb blocks internally, but allows for arbitrary reads
    char* realFilePos;     // 0x400C - real file's filePos, gets increased by bytesRead
    void* size;        // 0x4010 - returned by BvhFile_Func8 unless it's -1 - *0x4008 otherwise
    HANDLE handle;      // 0x4014
    unsigned int fileattributes;         // 0x4018 - bitmask related to the parameters the file was opened with
    char* filename1; // 0x401C
    char* filename2; // 0x4020
    int always0_0; // 0x4024
    int always0_1; // 0x4028
    int always0_2; // 0x402C
    int always0_3; // 0x4030


    // Writes a section of the file to it's handle, starting at the buffer_item. Returns the number of bytes actually written for comparison.
    // Updates realFilePos and filePos to point after the written bytes.
    DWORD WriteFileToHandle(char buffer_item, DWORD bytesToWrite)
    {
        LPDWORD bytesWritten;
        DWORD totalBytesWritten;
        HANDLE hFile;
        DWORD tempToWrite;

        // My own addition, just to avoid changing the buffer_item directly.
        // It's probably intentional, but for now, I haven't figured it out.
        LPCVOID buffer_temp = &buffer_item;

        if (bytesToWrite != 0)
        {
            hFile = this->handle;

            for (int d = bytesToWrite; d != 0; d -= tempToWrite)
            {
                // Writes in 64 KB chunks unless what's left is less.
                tempToWrite = 0xffff;
                if (d < 0x10000)
                    tempToWrite = d;

